Задание5/InformationRegisters/ШСВ_ОтсутствиеСотрудникаАстон.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ШСВ_ОтсутствиеСотрудникаАстон</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаОтсутствия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОкончанияОтсутствия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Задание5/CommonModules/ШСВ_ДнейОтсутствияРаботника/Ext/Module.bsl
Процедура ШСВ_ПодпискаНаСобытиеОтсутствиеРаботникаОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	// Вставить содержимое обработчика.
	Док = Источник; 
	
	Если ТипЗнч(Док) = Тип("ДокументОбъект.БольничныйЛист") Тогда
		
		НовыйЭлементРС = РегистрыСведений.ШСВ_ОтсутствиеСотрудникаАстон.СоздатьМенеджерЗаписи();
		НовыйЭлементРС.Сотрудник = Источник.Сотрудник;
		НовыйЭлементРС.ДатаНачалаОтсутствия = Источник.ДатаНачала;
		НовыйЭлементРС.ДатаОкончанияОтсутствия = Источник.ДатаОкончания;
		НовыйЭлементРС.КоличествоДней = (НовыйЭлементРС.ДатаОкончанияОтсутствия - НовыйЭлементРС.ДатаНачалаОтсутствия) / 86400 + 1;
		НовыйЭлементРС.Записать();
		
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументОбъект.Отпуск") Тогда
		
		НовыйЭлементРС = РегистрыСведений.ШСВ_ОтсутствиеСотрудникаАстон.СоздатьМенеджерЗаписи();
		НовыйЭлементРС.Сотрудник = Источник.Сотрудник;
		НовыйЭлементРС.ДатаНачалаОтсутствия = Источник.НачалоОтпуска;
		НовыйЭлементРС.ДатаОкончанияОтсутствия = Источник.ОкончаниеОтпуска;
		НовыйЭлементРС.КоличествоДней = (НовыйЭлементРС.ДатаОкончанияОтсутствия - НовыйЭлементРС.ДатаНачалаОтсутствия) / 86400 + 1;
		НовыйЭлементРС.Записать();
		
	Иначе
		
		НовыйЭлементРС = РегистрыСведений.ШСВ_ОтсутствиеСотрудникаАстон.СоздатьМенеджерЗаписи();
		НовыйЭлементРС.Сотрудник = Источник.Сотрудник;
		НовыйЭлементРС.ДатаНачалаОтсутствия = Источник.ДатаУвольнения;
		НовыйЭлементРС.ДатаОкончанияОтсутствия = Источник.ДатаУвольнения;
		НовыйЭлементРС.КоличествоДней = 0;
		НовыйЭлементРС.Записать();
		
	КонецЕсли;
	
КонецПроцедуры
